In [1]:
import pandas as pd
pd.options.display.max_rows = 6

## 문자열인 Value 전처리

In [39]:
ebola = pd.read_csv('/home/yahwang/doit_pandas/data/country_timeseries.csv')
ebola = ebola.iloc[:10, [0,1,2,3,10,11]]
df = ebola.melt(id_vars=['Date', 'Day'])
df

          Date  Day        variable   value
0     1/5/2015  289    Cases_Guinea  2776.0
1     1/4/2015  288    Cases_Guinea  2775.0
2     1/3/2015  287    Cases_Guinea  2769.0
..         ...  ...             ...     ...
37  12/24/2014  277  Deaths_Liberia  3413.0
38  12/21/2014  273  Deaths_Liberia     NaN
39  12/20/2014  272  Deaths_Liberia  3384.0

[40 rows x 4 columns]

### .str 함수

#### split

In [40]:
df.variable.str.split('_', expand=True) # 각각 컬럼으로 분리

         0        1
0    Cases   Guinea
1    Cases   Guinea
2    Cases   Guinea
..     ...      ...
37  Deaths  Liberia
38  Deaths  Liberia
39  Deaths  Liberia

[40 rows x 2 columns]

In [41]:
df.variable.str.split('_', expand=False)[:3] # 리스트로 분리

0    [Cases, Guinea]
1    [Cases, Guinea]
2    [Cases, Guinea]
Name: variable, dtype: object